// Одне яблуко коштує 5.99 грн. Ціна однієї груші - 7 грн.
// Ми маємо 23 грн.
// 1. Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?
// 2. Скільки груш ми можемо купити?
// 3. Скільки яблук ми можемо купити?
// 4. Чи ми можемо купити 2 груші та 2 яблука?
//
// Задача:
// Опишіть вирішення всіх пунктів задачі використовуючи необхідні змінні чи/та константи.
// Під опишіть, я маю на увазі наступне:
// Я маю збілдити ваш код і запустити програму. В результаті цього,
//я маю побачити роздруковані відповіді на поставлені вище запитання.
//Перед відповідю треба роздрукувати саме питання.
// Правильно обирайте типи даних та назви змінних чи констант.
// Публікація:
// Створити папку в своєму репозиторії в github та завантажити туди main.go файл, в котрому буде зроблено дане завдання.
package main

import (
	"fmt"
	"math"
)

const applePrice float64 = 5.99
const pearPrice float64 = 7.00

var moneyAmount float64

func main() {
	fmt.Println("Скільки у вас грошей?")
	fmt.Scan(&moneyAmount) //для удобности добавил, работает
	fmt.Println("Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?")
	money := applePrice*9 + pearPrice*8
	fmt.Println("Для цього нам потрiбно", money, "грн.")

	fmt.Println("Скільки груш ми можемо купити?")
	pear := float64(moneyAmount) / pearPrice
	fmt.Println("Ми можемо купити", math.Round(pear), "груш(і).")

	fmt.Println("Скільки яблук ми можемо купити?")
	aplle := float64(moneyAmount) / applePrice
	fmt.Println("Ми можемо купити", math.Round(aplle), "яблук(а).")

	fmt.Println("Чи ми можемо купити 2 груші та 2 яблука?")

	if (applePrice*2 + pearPrice*2) <= moneyAmount {
		fmt.Println("Так ми можемо купити 2 груші та 2 яблука")
	} else {
		fmt.Println("Ні ми не можемо купити 2 груші та 2 яблука?")
	}
}
